АлогистикТест2/src/Documents/алк_РучноеИзменениеДополнительныхПараметровПакета/алк_РучноеИзменениеДополнительныхПараметровПакета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_РучноеИзменениеДополнительныхПараметровПакета</name>
  <attributes>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Участок</name>
    <type>
      <types>CatalogRef.алк_Участки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидШпонаДо</name>
    <type>
      <types>EnumRef.алк_ВидыШпона</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидШпонаПосле</name>
    <type>
      <types>EnumRef.алк_ВидыШпона</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрипускДо</name>
    <type>
      <types>CatalogRef.алк_ВариантыПрипуска</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрипускПосле</name>
    <type>
      <types>CatalogRef.алк_ВариантыПрипуска</types>
    </type>
  </attributes>
  <attributes>
    <name>СлойДревесиныДо</name>
    <type>
      <types>EnumRef.алк_СлойДревесины</types>
    </type>
  </attributes>
  <attributes>
    <name>СлойДревесиныПосле</name>
    <type>
      <types>EnumRef.алк_СлойДревесины</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияНоменклатурыПЭОДо</name>
    <type>
      <types>CatalogRef.алк_КатегорияНоменклатурыПЭО</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияНоменклатурыПЭОПосле</name>
    <type>
      <types>CatalogRef.алк_КатегорияНоменклатурыПЭО</types>
    </type>
  </attributes>
  <attributes>
    <name>ГабаритДо</name>
    <type>
      <types>EnumRef.алк_ГабаритПакета</types>
    </type>
  </attributes>
  <attributes>
    <name>ГабаритПосле</name>
    <type>
      <types>EnumRef.алк_ГабаритПакета</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументДо</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПосле</name>
    <type>
      <types>DocumentRef.алк_РучноеИзменениеДополнительныхПараметровПакета</types>
    </type>
  </attributes>
</mdclass:Document>

АлогистикТест2/src/InformationRegisters/алк_ПакетыПоАддендумам/алк_ПакетыПоАддендумам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ПакетыПоАддендумам</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Аддендум</name>
    <type>
      <types>DocumentRef.алк_Аддендумы</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>DefinedType.алк_Количество</types>
    </type>
  </attributes>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПоОтгрузке</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/AccumulationRegisters/алк_ОстаткиЗапасов/алк_ОстаткиЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>алк_ОстаткиЗапасов</name>
  <resources>
    <name>Количество</name>
    <comment>Для пиловочника и пилмата это объем, для ДГ это вес</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Штабель</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

АлогистикТест2/src/Documents/алк_РучноеИзменениеДополнительныхПараметровПакета/ManagerModule.bsl
Процедура ИнициализироватьДанныеДокумента(РучноеИзменениеПараметров, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 	
	"ВЫБРАТЬ
	|	алк_РучноеИзменениеДополнительныхПараметровПакета.Дата КАК Период,
	|	алк_РучноеИзменениеДополнительныхПараметровПакета.СерийныйНомер КАК СерийныйНомер,
	|	алк_РучноеИзменениеДополнительныхПараметровПакета.ВидШпонаПосле КАК ВидШпона,
	|	алк_РучноеИзменениеДополнительныхПараметровПакета.ПрипускПосле КАК Припуск,
	|	алк_РучноеИзменениеДополнительныхПараметровПакета.СлойДревесиныПосле КАК СлойДревесины,
	|	алк_РучноеИзменениеДополнительныхПараметровПакета.КатегорияНоменклатурыПЭОПосле КАК КатегорияНоменклатурыПЭО,
	|	алк_РучноеИзменениеДополнительныхПараметровПакета.ГабаритПосле КАК Габарит,
	|	алк_РучноеИзменениеДополнительныхПараметровПакета.Ссылка КАК Документ
	|ИЗ
	|	Документ.алк_РучноеИзменениеДополнительныхПараметровПакета КАК алк_РучноеИзменениеДополнительныхПараметровПакета
	|ГДЕ
	|	алк_РучноеИзменениеДополнительныхПараметровПакета.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", РучноеИзменениеПараметров);
		
	РезультатЗапроса = Запрос.Выполнить();  
			
	ТабЗапроса = РезультатЗапроса.Выгрузить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДополнительныеПараметрыПакетов", ТабЗапроса);
	
КонецПроцедуры

Процедура ВыполнитьКонтрольИспользованияПакетаВАддендуме(СерийныйНомер, Дата, Отказ) Экспорт
	
	СтруктураАддендума = РегистрыСведений.алк_ПакетыПоАддендумам.ПолучитьАддендумИСтатусПоОтгрузкеПоСерийномуНомеруНаДату(СерийныйНомер, Дата); 
	
	Если СтруктураАддендума = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Аддендум = СтруктураАддендума.Адд;
	АддендумПоОтгрузке = СтруктураАддендума.ПоОтгрузке;
	
	//если отвязали адд, либо был отгружен, но есть на остатках, то проводим
	Если НЕ ЗначениеЗаполнено(Аддендум) ИЛИ АддендумПоОтгрузке Тогда 
		Возврат;
	КонецЕсли;
	//\\
	
	Сообщить(СтрШаблон("Серийный номер № %1 привязан к документу %2. Прежде чем выполнять операции с этим пакетом, его необходимо отвязать от Аддендума", 
	СерийныйНомер, Аддендум));
	Отказ = Истина;
	
КонецПроцедуры

Процедура ВыполнитьКонтрольОстатков(СерийныйНомер, Дата, Отказ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	алк_ОстаткиЗапасовОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	РегистрНакопления.алк_ОстаткиЗапасов.Остатки(&ДатаОстатков, СерийныйНомер = &СерийныйНомер) КАК алк_ОстаткиЗапасовОстатки
	|ГДЕ
	|	НЕ алк_ОстаткиЗапасовОстатки.КоличествоОстаток = 0";	
	Запрос.УстановитьПараметр("ДатаОстатков", Дата);
	Запрос.УстановитьПараметр("СерийныйНомер", СерийныйНомер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;
		Сообщить(СтрШаблон("Ошибка! Пакета № %1 нет на остаках на %2, проверьте наличие пакета на складе.",СерийныйНомер,Дата));	
	КонецЕсли;
	
КонецПроцедуры
